# Exploratory Data Analysis for IMDB Data #

In [162]:
!pwd

/Users/italo/Desktop/Course Material/section01/Module1 Project/2020-movie-analysis

In [2]:
import pandas as pd
names = pd.read_csv('Data/imdb.name.basics.csv')
names.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [3]:
names.tail()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [4]:
names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

***name features the names of different people in the industry and list their primary profession in the industry (actress, director, producer, etc.) as well as the prominent titles they are known for given as an identifier (primary key for another data set?). Also list, birth year and death year if applicable.***

In [5]:
title_akas = pd.read_csv('Data/imdb.title.akas.csv')
title_akas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [6]:
title_akas.tail()

,title_id,ordering,title,region,language,types,attributes,is_original_title
331698,tt9827784,2,Sayonara kuchibiru,NaN,NaN,original,NaN,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,NaN,0.0
331700,tt9880178,1,La atención,NaN,NaN,original,NaN,1.0
331701,tt9880178,2,La atención,ES,NaN,NaN,NaN,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,NaN,0.0

In [7]:
title_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [8]:
title_akas.region.value_counts()

US      51490
XWW     18467
RU      13817
DE      11634
FR      10990
        ...
LY          1
NC          1
WF          1
LS          1
CSHH        1
Name: region, Length: 213, dtype: int64

In [9]:
title_akas.language.value_counts()

en     22895
tr      3847
bg      3609
fr      3576
he      2680
       ...
wo         1
xh         1
ka         1
fro        1
ku         1
Name: language, Length: 76, dtype: int64

In [10]:
title_akas[title_akas.language == 'en']

,title_id,ordering,title,region,language,types,attributes,is_original_title
87,tt10027708,2,Miguelito,XWW,en,imdbDisplay,NaN,0.0
89,tt10027708,4,Miguelito,AU,en,NaN,NaN,0.0
95,tt1014759,10,Alice Dar Sarzamin E Ajayeb,IE,en,imdbDisplay,NaN,0.0
127,tt1014759,3,Alice in Wonderland,JP,en,NaN,NaN,0.0
142,tt10225354,3,Returning Home,XWW,en,alternative,NaN,0.0
...,...,...,...,...,...,...,...,...
331679,tt9644084,3,The Breath,XWW,en,alternative,NaN,0.0
331680,tt9654246,1,The Wild Man of the North,XWW,en,imdbDisplay,NaN,0.0
331683,tt9657946,1,Homing,XWW,en,imdbDisplay,NaN,0.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,NaN,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,NaN,0.0

In [11]:
title_akas[title_akas.region == 'US']

,title_id,ordering,title,region,language,types,attributes,is_original_title
12,tt0369610,21,Jurassic World 3D,US,NaN,NaN,3-D version,0.0
20,tt0369610,29,Jurassic World,US,NaN,NaN,NaN,0.0
21,tt0369610,2,Ebb Tide,US,NaN,NaN,fake working title,0.0
28,tt0369610,36,Jurassic Park IV,US,NaN,working,NaN,0.0
37,tt0369610,44,Jurassic Park 4,US,NaN,NaN,informal alternative title,0.0
...,...,...,...,...,...,...,...,...
331645,tt9310460,6,Coconut the Little Dragon 2 Into the Jungle,US,NaN,imdbDisplay,NaN,0.0
331654,tt9358044,2,Hail Satan?,US,NaN,imdbDisplay,NaN,0.0
331673,tt9562694,5,Alien Warfare,US,NaN,imdbDisplay,NaN,0.0
331686,tt9705860,1,Dusan Vukotic Croatian Oscar Winner,US,NaN,imdbDisplay,NaN,0.0
331694,tt9755806,1,Big Shark,US,NaN,NaN,NaN,0.0

In [12]:
title_akas.types.value_counts()

imdbDisplay         100461
original             44700
working               8680
alternative           6564
festival              3307
dvd                   2995
tv                    1617
video                  121
dvdimdbDisplay          1
festivalworking         1
Name: types, dtype: int64

***title_akas list the title of movies as they appear in different langauges and different regions. localized versions***

In [13]:
title_basics = pd.read_csv('Data/imdb.title.basics.csv')
title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [14]:
title_basics.tail()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

***title_basics lists the primary title of a movie. Primary title is the title of the film as it was advertised/promoted. It list the original title (in the original language). List year it was release, run_time, and up to three genres related to the movie***

In [15]:
title_basics[title_basics.start_year == 2019]

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
26,tt0263814,On kadin,On kadin,2019,NaN,Drama
31,tt0285423,Abolição,Abolição,2019,NaN,Documentary
68,tt0385887,Motherless Brooklyn,Motherless Brooklyn,2019,NaN,"Crime,Drama"
107,tt0437086,Alita: Battle Angel,Alita: Battle Angel,2019,122.0,"Action,Adventure,Sci-Fi"
...,...,...,...,...,...,...
146134,tt9916160,Drømmeland,Drømmeland,2019,72.0,Documentary
146135,tt9916170,The Rehearsal,O Ensaio,2019,51.0,Drama
146137,tt9916190,Safeguard,Safeguard,2019,90.0,"Drama,Thriller"
146138,tt9916428,The Secret of China,The Secret of China,2019,NaN,"Adventure,History,War"
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama

In [175]:
# write function that returns true if Sci-Fi is a genre for a movie
example = title_basics.iloc[107].genres
'Sci-Fi' in example

True

In [ ]:
# write funciton for entire column

In [16]:
crew = pd.read_csv('Data/imdb.title.crew.csv')
crew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [17]:
crew.shape

(146144, 3)

***crew list director(s) and writer(s) for a film. It is all reference using the unique id identifiers. For movie and names.***

In [18]:
principals = pd.read_csv('Data/imdb.title.principals.csv')
principals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [19]:
principals.category.unique()

array(['actor', 'director', 'producer', 'editor', 'actress', 'composer',
       'cinematographer', 'writer', 'self', 'production_designer',
       'archive_footage', 'archive_sound'], dtype=object)

In [20]:
principals.tconst.nunique()

143454

***principals list the principal cast and crew for a given movie (actor, directors, producers, etc.). Information can be found by access title's unique id as well as person's unique id)***

In [21]:
title_basics[title_basics.tconst == 'tt0111414']

      tconst primary_title original_title  start_year  runtime_minutes  genres
5  tt0111414   A Thin Life    A Thin Life        2018             75.0  Comedy

In [24]:
names[names.nconst == 'nm0246005']

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
45162,nm0246005,Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064"

In [25]:
ratings = pd.read_csv('Data/imdb.title.ratings.csv')
ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [26]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [27]:
title_basics[title_basics.tconst == 'tt1043726']

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
4825,tt1043726,The Legend of Hercules,The Legend of Hercules,2014,99.0,"Action,Adventure,Fantasy"

***ratings contains the average rating for a given title based on user reviews on imdb. As well as the number of votes used to get that rating***

In [28]:
ratings.sort_values('averagerating', ascending = False)

          tconst  averagerating  numvotes
27644  tt8730716           10.0         5
8992   tt1770682           10.0         5
26153  tt2632430           10.0         5
65033  tt9715646           10.0        20
57679  tt5344358           10.0         6
...          ...            ...       ...
50971  tt6017238            1.0        21
32440  tt2087999            1.0         7
36456  tt1896768            1.0        21
54856  tt1976600            1.0       436
39248  tt8654080            1.0        21

[73856 rows x 3 columns]

In [29]:
title_basics[title_basics.tconst == 'tt8730716']

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
136750,tt8730716,Pick It Up! - Ska in the '90s,Pick It Up! - Ska in the '90s,2019,99.0,Documentary

## rename columns for easier manipulation ##

In [30]:
new_names = {'nconst' : 'name_id', 'tconst' : 'title_id'}

In [31]:
names.rename(new_names, axis = 1, inplace = True)
names.head(2)

,name_id,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"

In [32]:
title_akas.rename(new_names, axis = 1, inplace = True)
title_akas.head(2)

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0

In [33]:
title_basics.rename(new_names, axis = 1, inplace = True)
title_basics.head(2)

,title_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

In [34]:
crew.rename(new_names, axis = 1, inplace = True)
crew.head(2)

    title_id  directors              writers
0  tt0285252  nm0899854            nm0899854
1  tt0438973        NaN  nm0175726,nm1802864

In [35]:
principals.rename(new_names, axis = 1, inplace = True)
principals.head(2)

    title_id  ordering    name_id  category  job   characters
0  tt0111414         1  nm0246005     actor  NaN  ["The Man"]
1  tt0111414         2  nm0398271  director  NaN          NaN

In [36]:
ratings.rename(new_names, axis = 1, inplace = True)
ratings.head(2)

     title_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559

In [37]:
title_basics.head(2)

,title_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

In [38]:
ratings.head(2)

     title_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559

In [39]:
title_basics.set_index('title_id', inplace = True)
ratings.set_index('title_id', inplace = True)

In [40]:
basics_and_ratings = title_basics.join(ratings, how = 'left')

In [41]:
basics_and_ratings.drop('index', axis = 1, inplace = True)

KeyError: "['index'] not found in axis"

In [43]:
basics_and_ratings.head()

,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
title_id,,,,,,,
tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0
tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43.0
tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0
tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13.0
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119.0

### List of DataFrames ###

name = name of people in the industry and notable works

basics_and_ratings = basic info of film, including title(s), runtime, year released, genre, average rating, number of votes

title_akas = lists movie titles in different regions on their localizations

crew = writer(s) and director(s) for different movies

principals = principal crew/cast for a movie

In [45]:
print(names.shape)
print(basics_and_ratings.shape)
print(title_akas.shape)
print(crew.shape)
print(principals.shape)

(606648, 6)
(146144, 7)
(331703, 8)
(146144, 3)
(1028186, 6)

In [79]:
#alternate basics_and_ratings:
basics_and_ratings2 = pd.merge(title_basics, ratings, on = 'title_id')
basics_and_ratings2.isnull().any()

title_id           False
primary_title      False
original_title     False
start_year         False
runtime_minutes     True
genres              True
averagerating      False
numvotes           False
dtype: bool

In [91]:
basics_and_ratings.sort_values(by = 'start_year', inplace = True)
basics_and_ratings.head()

,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
title_id,,,,,,,
tt1566491,Brainiacs in La La Land,Brainiacs in La La Land,2010,NaN,Comedy,NaN,NaN
tt1731226,Respira,Respira,2010,65.0,Documentary,NaN,NaN
tt1731229,The Depths,The Depths,2010,121.0,Drama,4.0,121.0
tt1731230,Turquaze,Turquaze,2010,96.0,Drama,6.1,345.0
tt1731655,Ten Days: Terese Taylor,Ten Days: Terese Taylor,2010,77.0,"Documentary,Music",NaN,NaN

In [92]:
basics_and_ratings2.sort_values(by = 'start_year', inplace  = True)
basics_and_ratings2.head()

,title_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
5553,tt1612608,The Italian,L'Italien,2010,102.0,"Comedy,Drama",5.8,1360
49321,tt4874854,The Legend of Zelda: The Triforce Prophecy,The Legend of Zelda: The Triforce Prophecy,2010,120.0,"Adventure,Fantasy,Romance",4.8,8
8206,tt1718842,Nakalnya anak muda,Nakalnya anak muda,2010,75.0,"Horror,Thriller",4.0,12
6276,tt1645134,Sandcastle,Sandcastle,2010,91.0,Drama,6.3,116
6274,tt1645129,Planzet,Puranzetto,2010,53.0,"Action,Animation,Sci-Fi",4.6,290

In [93]:
basics_and_ratings.to_csv('imdb.basics_and_ratings_nulls.csv', index = False)
basics_and_ratings2.to_csv('imdb.basics_and_ratings_nonulls.csv', index = False)